Revit 2026 API

# SpatialElementBoundaryOptions Properties

---

The SpatialElementBoundaryOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SpatialElementBoundaryLocation | The boundary of spatial element for geometry calculation. |
|  | StoreFreeBoundaryFaces | Indicates whether to include the free boundary faces in the result. |

#### Reference

SpatialElementBoundaryOptions Class

Autodesk.Revit.DB Namespace